from SunFunctions.browser_open import chrome_open
from SunFunctions.browser_open import fox_open
from SunFunctions.browser_open import edge_open

# 220814 行四念處．不離身受心法－菩薩行…第64集《維摩詰經》…#北大聖玄 #覺曦軒** (1:20:27)
chrome_open('https://www.youtube.com/watch?v=a4aLxrkdam4', 20, 480)

# 220803 關鍵時刻．出奇制勝…文殊八字真言－簡介…北大．聖玄主講 (10:12)
# chrome_open('https://www.youtube.com/watch?v=AdgbapI5l6c', 10, 260)

# 220819 世間無常－科學會通 …13-1集《視頻化－聖玄語錄》…#北大聖玄 #覺曦軒 (5:43)
chrome_open('https://www.youtube.com/watch?v=RBrjW5WMnjw', 10, 170)

# 220817 走投無路．出奇制勝－馬斯克秘笈…75集《5分鐘·奇葩&閨蜜》…#北大聖玄#覺曦軒 (10:00)
# chrome_open('https://www.youtube.com/watch?v=7ojrkRWdhvU', 10, 190)

# 220816 探密－異次元物語…04集《視頻化·異次元－解密》》…#北大聖玄#覺曦軒 (13:10)
# chrome_open('https://www.youtube.com/watch?v=dqGfFAJyV3c', 10, 300)

# 220915 解套·畢業就是失業…第8集《煩惱·DUCK不必》修三…#北大聖玄#覺曦軒 (5:30)
# chrome_open('https://www.youtube.com/watch?v=BQ1O_K4ZTRI', 20, 160)

# 220807 不貪著、不隨順－菩薩行…第63集《維摩詰經》…#北大聖玄 #覺曦軒 (1:16:00)
# chrome_open('https://www.youtube.com/watch?v=DOCLDnu3LjE', 10, 500)

# 220813 新奢華－全心奢華…第74集《5分鐘·奇葩&閨蜜》…#北大聖玄#覺曦軒 (6:49)
# chrome_open('https://www.youtube.com/watch?v=XuqjFXVATxY', 10, 200)

# 220812 慶盂蘭盆．贊中元－跨領域對話…10集《視頻化·微享－節慶》…#北大聖玄 #覺曦軒 (11:08)
# chrome_open('https://www.youtube.com/watch?v=TpZjCJlWigw', 10, 250)

# 220810 破壞性創新－實操落地…第73集《5分鐘·奇葩&閨蜜》…#北大聖玄#覺曦軒 (7:01)
# chrome_open('https://www.youtube.com/watch?v=C1uiJrPx2pQ', 10, 200)

# 220809 移居火星－科學巨人評析…第3集《視頻化．異次元－解密》…#北大聖玄#覺曦軒 (9:19)
# chrome_open('https://www.youtube.com/watch?v=3O7OCFnaf3I', 10, 180)

# 220731 見菩提相而取證－增上慢人…第62集《維摩詰經》…#北大聖玄 #覺曦軒 (1:50:08)
# chrome_open('https://www.youtube.com/watch?v=fGsIxQ1e_yA', 20, 500)

# 220808 壯闊的愛－外一章…09集《視頻化·微享－節慶篇》修一版…#北大聖玄#覺曦軒 (7:15)
# chrome_open('https://www.youtube.com/watch?v=xVAqv2ELzAY', 10, 140)

# 220806 腦科學－禪定vs.腦波…第71集《5分鐘·奇葩&閨蜜》…#北大聖玄#覺曦軒 (6:07)
# chrome_open('https://www.youtube.com/watch?v=bX6Yw_sL7mw', 10, 180)

# 220805 文殊睿智－驚艷度眾…14-12集《聖玄語露》…#北大聖玄 #覺曦軒 (5:33)
# chrome_open('https://www.youtube.com/watch?v=JYhiUNdI8MQ', 10, 165)

# 220725 解套．顛倒夢想…第7集《煩惱．DUCK 不必》…#北大聖玄#覺曦軒 (4:24)
# chrome_open('https://www.youtube.com/watch?v=Kn4tQ-HxkRw', 20, 200)

# 220804 傳說中的…新瓶舊酒…02集《關鍵出擊》…#北大聖玄#覺曦軒 (8:33)
# chrome_open('https://www.youtube.com/watch?v=Tp0vS1GNjaE', 10, 240)

# 220802 第一性原理．息災免難－文殊八字…07集《視頻化．微享》…#北大聖玄 #覺曦軒 (7:10)
# chrome_open('https://www.youtube.com/watch?v=OAXXttgBn7Q', 10, 260)

# 220724 菩提性相空寂－無有可得者…第61集《維摩詰經》…#北大聖玄 #覺曦軒 (1:36:56)
# chrome_open('https://www.youtube.com/watch?v=0TWTYnv1j3E', 10, 500)

# 220622 《10分鐘·奇葩＆閨蜜》第61集; 預立遺囑－臨終關懷; 預立遺囑…時代前沿脈動…跟上得利！ (5:47)
# chrome_open('https://b.scene.ryxiut.net/s/zCSoSuuy/1657409891884?bt=yxy', 50, 8, 3)
# chrome_open('https://www.youtube.com/watch?v=mW8HAcnSSkc', 10, 340)
# chrome_open('https://www.youtube.com/watch?v=mW8HAcnSSkc', 60, 260)

# 220730 黃金屋．顏如玉－炸開傳統……第三名投稿文《視頻化·教學相長·61-10集》…#北大聖玄#覺曦軒…修一 (16:04)
# chrome_open('https://www.youtube.com/watch?v=uCr15pAv9OI', 10, 300)

# 220729 仗劍殺佛－甚深意涵…14-11集《聖玄語露》…#北大聖玄 #覺曦軒 (5:21)
# chrome_open('https://www.youtube.com/watch?v=sK_m0WI89iQ', 10, 220)

# 220728 多頭運作 - 王牌金腦…第二名投稿文《視頻化·教學相長·60-8集》…#北大聖玄#覺曦軒 (14:34)
# chrome_open('https://www.youtube.com/watch?v=-rvnt8Ec3_c', 10, 300)

# 220727 馬斯克秘笈－夢想落地…第72集《5分鐘·奇葩&閨蜜》…#北大聖玄#覺曦軒 (5:40)
# chrome_open('https://www.youtube.com/watch?v=34ac3JVi-Kc', 10, 240)

# 220726 光 - 進出異次元介質…第02集《視頻化．異次元－解密》…#北大聖玄 #覺曦軒 (13:15)
# chrome_open('https://www.youtube.com/watch?v=uvDr70bBCBw', 10, 300)

# 220711 《煩惱．DUCK 不必》第6集 解套．臨終恐懼五大事…#北大聖玄#覺曦軒 (5:00)
# chrome_open('https://www.youtube.com/watch?v=rBpaNnwZZlI', 10, 250)

# 220727 菩提之相－實無有法可知…第60集《維摩詰經》…#北大聖玄 #覺曦軒 (1:22:14)
# chrome_open('https://www.youtube.com/watch?v=2yBiVxmsn1A', 10, 500)

# 220723 《5分鐘·奇葩＆閨蜜》第70集 主題：困境vs.仙境－一念之間; 思惟昇華…超越一切束縛…困境變仙境！ (6:55)
# chrome_open('https://www.youtube.com/watch?v=NXlLbuargJE', 10, 260)

# 220722《聖玄語露·第14-9集》🌺🌺🌺無相修慧－四大關鍵意涵 (5:42)
# chrome_open('https://www.youtube.com/watch?v=ez8olIX-dNY', 10, 240)

# 220721 《視頻化·微享》北大尼師 - 大陸情…04集…#北大聖玄 #覺曦軒 (3:19)
# chrome_open('https://www.youtube.com/watch?v=O3tx5k1fiBY', 10, 180)

# 220720 《5分鐘·奇葩＆閨蜜》第69集🌺🌺主題：對望－明月窗‧裝飾夢; 對望的深度省思－橋上風景‧樓上看 (3:37)
# chrome_open('https://www.youtube.com/watch?v=4wOjqauZwro', 10, 200)

# 220719 異次元探秘—生、死切換…01集《視頻化‧異次元—解密》…#北大聖玄 #覺曦軒 (10:35)
# edge_open('https://www.youtube.com/watch?v=gcxxb668FFc', 10, 200)
# chrome_open('https://www.youtube.com/watch?v=gcxxb668FFc', 10, 200)

# 220710 觀不生．不入正位－菩薩…第59集《維摩詰經》…#北大聖玄 #覺曦軒
# chrome_open('https://www.youtube.com/watch?v=R55B_yQASn4', 10, 500)
# chrome_open('https://www.youtube.com/watch?v=R55B_yQASn4', 10, 200, 0)

# 220717 《視頻化·微享》🌺🌺主題：耕心有成·正道圓成－觀音自在解脫 (4:48)
# chrome_open('https://www.youtube.com/watch?v=UYwuW040ci8', 10, 240)
# edge_open('https://www.youtube.com/watch?v=UYwuW040ci8', 10, 240)

# 220716 《5分鐘‧奇葩&閨蜜》冷眼紅塵－東方不敗…第68集 (5:42)
# chrome_open('https://www.youtube.com/watch?v=ml0JabzkPEc', 10, 300)
# fox_open('https://www.youtube.com/watch?v=ml0JabzkPEc', 10, 300)
# edge_open('https://www.youtube.com/watch?v=ml0JabzkPEc', 10, 300)



